In [5]:
import numpy as np
import pandas as pd

In [6]:
a = [2,3,4,5,6]
labs = ['b','c','d','e','f']
pd.Series(a,labs)

b    2
c    3
d    4
e    5
f    6
dtype: int64

In [7]:
pd.Series(data=a,index=labs)

b    2
c    3
d    4
e    5
f    6
dtype: int64

In [8]:
arr = np.array(a)
arr

array([2, 3, 4, 5, 6])

In [9]:
pd.Series(arr,labs)

b    2
c    3
d    4
e    5
f    6
dtype: int32

In [10]:
d = {'a':100,'b':200,'c':300,'d':400}
d

{'a': 100, 'b': 200, 'c': 300, 'd': 400}

In [11]:
pd.Series(d)

a    100
b    200
c    300
d    400
dtype: int64

In [12]:
ser1 = pd.Series(data = [20,30,40,50,60],index = ['a','b','c','d','e'])
ser1

a    20
b    30
c    40
d    50
e    60
dtype: int64

In [13]:
ser2 = pd.Series(data = [2,3,4,5],index = ['red','blue','yellow','green'])
ser2

red       2
blue      3
yellow    4
green     5
dtype: int64

In [14]:
ser2['green']

5

In [15]:
ser2[3]

5

In [16]:
ser2[1:3]

blue      3
yellow    4
dtype: int64

In [17]:
ser1

a    20
b    30
c    40
d    50
e    60
dtype: int64

In [18]:
ser2

red       2
blue      3
yellow    4
green     5
dtype: int64

In [49]:
pd.Series(ser2,ser1)

20   NaN
30   NaN
40   NaN
50   NaN
60   NaN
dtype: float64

In [20]:
ser1+ser2

a        NaN
b        NaN
blue     NaN
c        NaN
d        NaN
e        NaN
green    NaN
red      NaN
yellow   NaN
dtype: float64

## Data Frames

In [21]:
import numpy as np
import pandas as pd
from numpy.random import randn
np.random.seed(101)

In [65]:
df = pd.DataFrame(data=randn(5,4),index=['a','b','c','d','e'],columns=['w','x','y','z'])
df

          w         x         y         z
a  0.238127  1.996652 -0.993263  0.196800
b -1.136645  0.000366  1.025984 -0.156598
c -0.031579  0.649826  2.154846 -0.610259
d -0.755325 -0.346419  0.147027 -0.479448
e  0.558769  1.024810 -0.925874  1.862864

In [23]:
df['w']

a    2.706850
b    0.651118
c   -2.018168
d    0.188695
e    0.190794
Name: w, dtype: float64

In [24]:
type(df['w'])

pandas.core.series.Series

In [25]:
df[['x','z']]

          x         z
a  0.628133  0.503826
b -0.319318  0.605965
c  0.740122 -0.589001
d -0.758872  0.955057
e  1.978757  0.683509

In [130]:
df['new']=df['z']+df['x']
df

          w         x         y         z       new
a  0.238127  1.996652 -0.993263  0.196800  2.193452
b -1.136645  0.000366  1.025984 -0.156598 -0.156231
c -0.031579  0.649826  2.154846 -0.610259  0.039567
d -0.755325 -0.346419  0.147027 -0.479448 -0.825867
e  0.558769  1.024810 -0.925874  1.862864  2.887674

In [27]:
df.drop(labels='new',axis=1)
# deletes temporary. if typed df it can be accessed again

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [28]:
df.drop(labels='new',axis=1,inplace=True)
df #inplace=true deletes permanently

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [29]:
df.drop(labels='e',axis=0)
#deletes temporarily, for permanent deletion use inplace=True as parameter

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057

# Selecting rows

In [30]:
df.loc['d']

w    0.188695
x   -0.758872
y   -0.933237
z    0.955057
Name: d, dtype: float64

# Selecting a value using row and column

In [31]:
df.loc['c','w']

-2.018168244037392

In [32]:
df.loc[['b','c']]

          w         x         y         z
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001

In [33]:

df.loc[['b','c'],['x','y']]

          x         y
b -0.319318 -0.848077
c  0.740122  0.528813

In [34]:
df>0

       w      x      y      z
a   True   True   True   True
b   True  False  False   True
c  False   True   True  False
d   True  False  False   True
e   True   True   True   True

In [35]:
b = df>0

In [36]:
df[b]

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118       NaN       NaN  0.605965
c       NaN  0.740122  0.528813       NaN
d  0.188695       NaN       NaN  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [37]:
df[df>0]

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118       NaN       NaN  0.605965
c       NaN  0.740122  0.528813       NaN
d  0.188695       NaN       NaN  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [38]:
df[(df['w']>0) & (df['y']>1)] # and operator

          w         x         y         z
e  0.190794  1.978757  2.605967  0.683509

In [39]:
df[(df['w']>0) | (df['y']>1)] # or operator

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [40]:
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [41]:
df.reset_index()

  index         w         x         y         z
0     a  2.706850  0.628133  0.907969  0.503826
1     b  0.651118 -0.319318 -0.848077  0.605965
2     c -2.018168  0.740122  0.528813 -0.589001
3     d  0.188695 -0.758872 -0.933237  0.955057
4     e  0.190794  1.978757  2.605967  0.683509

In [42]:
new_index = ['R','G','B','O','Y']

In [43]:
df['colors'] = new_index
df

          w         x         y         z colors
a  2.706850  0.628133  0.907969  0.503826      R
b  0.651118 -0.319318 -0.848077  0.605965      G
c -2.018168  0.740122  0.528813 -0.589001      B
d  0.188695 -0.758872 -0.933237  0.955057      O
e  0.190794  1.978757  2.605967  0.683509      Y

In [44]:
df.set_index('colors')

               w         x         y         z
colors
R       2.706850  0.628133  0.907969  0.503826
G       0.651118 -0.319318 -0.848077  0.605965
B      -2.018168  0.740122  0.528813 -0.589001
O       0.188695 -0.758872 -0.933237  0.955057
Y       0.190794  1.978757  2.605967  0.683509

In [45]:
outside = ['red','red','red','green','green','green']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index

[('red', 1), ('red', 2), ('red', 3), ('green', 1), ('green', 2), ('green', 3)]

In [46]:
multi_index = pd.MultiIndex.from_tuples(hier_index,names=['Color','Number'])
multi_index

MultiIndex([(  'red', 1),
            (  'red', 2),
            (  'red', 3),
            ('green', 1),
            ('green', 2),
            ('green', 3)],
           names=['Color', 'Number'])

In [47]:
pd.DataFrame(data=randn(6,3),index=multi_index,columns=['A','B','C'])

                     A         B         C
Color Number
red   1       0.302665  1.693723 -1.706086
      2      -1.159119 -0.134841  0.390528
      3       0.166905  0.184502  0.807706
green 1       0.072960  0.638787  0.329646
      2      -0.497104 -0.754070 -0.943406
      3       0.484752 -0.116773  1.901755

In [48]:
df.loc['red']

KeyError: 'red'

In [ ]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [ ]:
df.xs['red'] # is same as df.loc['red']

In [ ]:
d = {'A':[1,2,np.nan],'B':[3,np.nan,np.nan],'C':[4,5,6]}
d

In [ ]:
pd.DataFrame(d)

In [ ]:
df = pd.DataFrame(d)

In [ ]:
df.dropna()

In [ ]:
df.dropna(axis=1) #by default 0, if 1 it applies to col

In [ ]:
df.dropna(axis=0,thresh=2) # if thresh=n, atleast n values should be present by if specified by row or column

In [ ]:
df

In [ ]:
df.fillna(value='New value')

In [ ]:
df['A'].fillna(value=df['A'].mean()) # this shows temporarily

# Group By method

In [ ]:
team_data = {'Company':['Apple','Apple','FB','FB','Google','Google'],
            'Person':['Mark','Tom','John','Sara','Mia','Emma'],
            'Sales':[200,150,300,125,260,180]}
team_data

In [ ]:
df = pd.DataFrame(team_data)
df

In [ ]:
df.groupby('Company')

In [ ]:
b = df.groupby(by = 'Company')

In [ ]:
b.mean()

In [ ]:
b.sum()

In [ ]:
b.std()

In [ ]:
b.sum().loc['Apple']

In [ ]:
df.groupby(by = 'Company').sum().loc['Apple']

In [ ]:
b.count()

In [ ]:
b.max()

In [ ]:
b.min()

In [ ]:
df.groupby(by='Company').describe() #groupby with describe function

In [ ]:
df.groupby(by='Company').describe().transpose()

In [ ]:
df.groupby(by='Company').describe().loc['Apple']

In [ ]:
df1 = pd.DataFrame({'A':['A0','A1','A2','A3'],
                   'B':['B0','B1','B2','B3'],
                   'C':['C0','C1','C2','C3'],
                   'D':['D0','D1','D2','D3']},
                  index=[0,1,2,3])
df2 = pd.DataFrame({'A':['A4','A5','A6','A7'],
                   'B':['B4','B5','B6','B7'],
                   'C':['C4','C5','C6','C7'],
                   'D':['D4','D5','D6','D7']},
                  index=[4,5,6,7])
df3 = pd.DataFrame({'A':['A8','A9','A10','A11'],
                   'B':['B8','B9','B10','B11'],
                   'C':['C8','C9','C10','C11'],
                   'D':['D8','D9','D10','D11']},
                  index=[8,9,10,11])

In [ ]:
df1

In [ ]:
df2

In [ ]:
df3

# Data Frames Concatenation

In [ ]:
pd.concat(objs=[df1,df2,df3])

In [ ]:
pd.concat(objs=[df1,df2,df3],axis=1)

# Data Frames Merging

In [ ]:
df4=pd.DataFrame({'Key':['K0','K1','K2','K3'],
                   'A':['A0','A1','A2','A3'],
                   'B':['B0','B1','B2','B3']})
 
df5=pd.DataFrame({'Key':['K0','K1','K2','K3'],
                    'C':['C0','C1','C2','C3'],
                    'D':['D0','D1','D2','D3']})

In [ ]:
df4

In [ ]:
df5

In [ ]:
pd.merge(left=df4,right=df5,on='Key')

In [51]:
df6 = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
df7 = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [52]:
df6

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [53]:
df7

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [54]:
pd.merge(left=df6,right=df7,on=['key1','key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

# Data Frames Join

In [ ]:
df8 = pd.DataFrame({'A':['A0','A1','A2','A3'],
                  'B':['B0','B1','B2','B3']},
                    index=['K0','K1','K2','K3'])
 
df9 = pd.DataFrame({'C':['C0','C1','C2','C3'],
                  'D':['D0','D1','D2','D3']},
                    index=['K0','K1','K2','K3'])

In [ ]:
df8

In [ ]:
df9

In [ ]:
df8.join(df9)

# Data Frame Operations

In [ ]:
d = {'col1':[1,2,3,4],
     'col2':[45,55,65,45],
     'col3':['asd','jkl','qwe','xyz']}

In [ ]:
df=pd.DataFrame(d)
df

In [ ]:
df['col2'].unique()

In [ ]:
len(df['col2'].unique())

In [ ]:
df['col2'].value_counts()

In [ ]:
# apply method

In [ ]:
def times5(x):
    return x*5

In [ ]:
times5(10)

In [ ]:
df['col1'].sum()

In [ ]:
df['col1'].apply(times5)

In [ ]:
df['col3'].apply(len)

In [ ]:
df.drop('col1',axis=1)

In [ ]:
df.columns

In [ ]:
df.index

In [ ]:
df.sort_values('col2')

In [ ]:
df.isnull()

# Reading and Writing files in pandas

## Reading and writing CSV files

In [ ]:
pwd

In [139]:
d = {'name':['Sara','Tom','Mark','Vinny'],
     'score':[75,80,85,90],
     'number':[22,25,27,30]}

In [140]:
d

{'name': ['Sara', 'Tom', 'Mark', 'Vinny'],
 'score': [75, 80, 85, 90],
 'number': [22, 25, 27, 30]}

In [143]:
df = pd.DataFrame(d)
df

    name  score  number
0   Sara     75      22
1    Tom     80      25
2   Mark     85      27
3  Vinny     90      30

In [ ]:
df.to_csv('test_2.csv')1

In [136]:
pd.read_csv('C://Users//user//Desktop//Data Analysis//test_2.csv',index_col=0)

    name  score  number
0   Sara     75      22
1    Tom     80      25
2   Mark     85      27
3  Vinny     90      30

# Reading and writing Excel files

In [ ]:
pd.read_excel('C:/Users/user/Desktop/Data Analysis/test_2.xlsx',index_col=0)

In [ ]:
pd.__version__

# Exercises

### Create a data frame with your roll number along with 3 subjects

In [64]:
pd.DataFrame({'Rollnumber':[501,502,503],'Sub1':[8,9,7],'Sub2':[7,9,8],'Sub3':[7,8,9]})

   Rollnumber  Sub1  Sub2  Sub3
0         501     8     7     7
1         502     9     9     8
2         503     7     8     9

In [69]:
pd.DataFrame([['J5',8,9,7],['F2',8,9,7],['F3',7,8,9]],index=['a','b','c'],columns=['Rollnumber','Sub1','Sub2','Sub3'])

  Rollnumber  Sub1  Sub2  Sub3
a         J5     8     9     7
b         F2     8     9     7
c         F3     7     8     9

In [75]:
d1 = pd.DataFrame({"Rollno":['18471A05J'+str(i) for i in range(1,11,1)],
                    "Pandas":np.random.randint(1,10),
                    "Numpy":np.random.randint(1,10)})
d1

        Rollno  Pandas  Numpy
0   18471A05J1       7      7
1   18471A05J2       7      7
2   18471A05J3       7      7
3   18471A05J4       7      7
4   18471A05J5       7      7
5   18471A05J6       7      7
6   18471A05J7       7      7
7   18471A05J8       7      7
8   18471A05J9       7      7
9  18471A05J10       7      7

In [100]:
d1.loc[[0,2,5]]

       Rollno  Pandas  Numpy
0  18471A05J1       7      7
2  18471A05J3       7      7
5  18471A05J6       7      7

In [94]:
d1.head(3)

       Rollno  Pandas  Numpy
0  18471A05J1       7      7
1  18471A05J2       7      7
2  18471A05J3       7      7

In [92]:
d1.sample(4)

       Rollno  Pandas  Numpy
0  18471A05J1       7      7
2  18471A05J3       7      7
5  18471A05J6       7      7
3  18471A05J4       7      7

In [96]:
d1.shape

(10, 3)

In [128]:
d1.loc[0:10:2,['Rollno','Pandas']] # to get even number of rows

       Rollno  Pandas
0  18471A05J1       7
2  18471A05J3       7
4  18471A05J5       7
6  18471A05J7       7
8  18471A05J9       7

In [131]:
weather_df = pd.read_csv("https://raw.githubusercontent.com/boppanaravisastry/Data-Analysis-Using-Python-MB9/master/Day07_03Dec2020/weather.csv")
weather_df

    s.no        day  temparature  winspeed    event
0      1   1/2/2019         30.0      12.0     rain
1      1   1/2/2019          NaN      14.0      NaN
2      2   1/3/2019         43.0      13.0     rain
3      3   1/4/2019         55.0       NaN  fullair
4      4   1/5/2019         66.0      10.0      NaN
5      5   1/6/2019         34.0      15.0     cold
6      6   1/7/2019          NaN      17.0  fullair
7      7   1/8/2019         89.0       NaN     cold
8      8   1/9/2019          NaN       9.0  fullair
9      9  1/10/2019         90.0      11.0     cold
10    10  1/11/2019         65.0       NaN      NaN
11    11  1/12/2019          NaN      20.0  fullair

In [146]:
w1 = pd.read_csv("ref.csv")
w1

    s.no        day  temparature  winspeed    event
0      1   1/2/2019         30.0      12.0     rain
1      1   1/2/2019          NaN      14.0      NaN
2      2   1/3/2019         43.0      13.0     rain
3      3   1/4/2019         55.0       NaN  fullair
4      4   1/5/2019         66.0      10.0      NaN
5      5   1/6/2019         34.0      15.0     cold
6      6   1/7/2019          NaN      17.0  fullair
7      7   1/8/2019         89.0       NaN     cold
8      8   1/9/2019          NaN       9.0  fullair
9      9  1/10/2019         90.0      11.0     cold
10    10  1/11/2019         65.0       NaN      NaN
11    11  1/12/2019          NaN      20.0  fullair

In [147]:
pd.read_clipboard()

   s.no,day,temparature,winspeed,event
0                1,1/2/2019,30,12,rain
1                1,1/2/2019,NaN,14,NaN
2                2,1/3/2019,43,13,rain
3            3,1/4/2019,55,NaN,fullair
4                 4,1/5/2019,66,10,NaN
5                5,1/6/2019,34,15,cold
6            6,1/7/2019,NaN,17,fullair
7               7,1/8/2019,89,NaN,cold
8             8,1/9/2019,NaN,9,fullair
9               9,1/10/2019,90,11,cold
10             10,1/11/2019,65,NaN,NaN
11         11,1/12/2019,NaN,20,fullair

In [152]:
d=pd.read_csv('Iris.csv')
d

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
0,1,5.1,3.5,1.4,0.2,Iris-setosa
1,2,4.9,3.0,1.4,0.2,Iris-setosa
2,3,4.7,3.2,1.3,0.2,Iris-setosa
3,4,4.6,3.1,1.5,0.2,Iris-setosa
4,5,5.0,3.6,1.4,0.2,Iris-setosa
...,...,...,...,...,...,...
145,146,6.7,3.0,5.2,2.3,Iris-virginica
146,147,6.3,2.5,5.0,1.9,Iris-virginica
147,148,6.5,3.0,5.2,2.0,Iris-virginica
148,149,6.2,3.4,5.4,2.3,Iris-virginica
149,150,5.9,3.0,5.1,1.8,Iris-virginica

In [153]:
d['Species']

0         Iris-setosa
1         Iris-setosa
2         Iris-setosa
3         Iris-setosa
4         Iris-setosa
            ...
145    Iris-virginica
146    Iris-virginica
147    Iris-virginica
148    Iris-virginica
149    Iris-virginica
Name: Species, Length: 150, dtype: object

In [154]:
d['Species'].value_counts()

Iris-virginica     50
Iris-versicolor    50
Iris-setosa        50
Name: Species, dtype: int64

In [158]:
ww = d.groupby('Species')